from pynput import mouse
import keyboard, random, threading, math, time, sys, os


playerX = 10
playerY = 10
xSpeed = 0.18 * 3
ySpeed = 0.1 * 3
diag = math.sqrt((ySpeed**2) + (xSpeed**2))
assets = {
    "bars": R""" HP: 75/100 | >===============-----< 
 Mana: 50/100 | >==========----------< """,
    "numbers": R"12345678901234567890123456789012345678901234567890",
    "crosshair": R"""ššš|ššš
---+---
ššš|ššš
""",
    "background": R"""|--___                                                                                                                                                ___--|
|╔═══╗¯¯---___                                                                                                                                ___---¯¯╔═══╗|
|╠═╗/╠═══╦═══╗¯¯--___                                                                                                                  ___--¯¯╔═══╦═══╣\╔═╣|
|╠/╠═╩═╦═╩═╗/╠═══╦══╗¯¯---________________________________________________________________________________________________________---¯¯╔══╦═══╣\╔═╩═╦═╩═╣\╣|
|╠═╩═╦═╩═╗/╠═╩═╦═╩╗/╚╦═══╦═╗|╔═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦═══╦╗|╔═╦═══╦╝\╔╩═╦═╩═╣\╔═╩═╦═╩═╣|
|╠═╦═╩╦╗/╠═╩═╦═╩╗/╚╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦╝\╔╩═╦═╩═╣\╔╦╩═╦═╣|
|╠═╬╦═╝╠═╩═╦═╩═╗╚╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩══╣|╠═╦═╩═╦═╩═╦╝╔═╩═╦═╩═╣╚═╦╬═╣|
|╠═╝╚╦═╩═╦═╩═╗/╠═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦══╣|╠═╩═╦═╩═╦═╩═╣\╔═╩═╦═╩═╦╝╚═╣|
|╠═╦═╩═╦═╩═╦╗╠═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╣╔╦═╩═╦═╩═╦═╣|
|╠═╩═╦═╩═╗/║╚╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩╝║\╔═╩═╦═╩═╣|
|╠═╦═╩╦╗/╠═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╣\╔╦╩═╦═╣|
|╠═╩╦═╝╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣╚═╦╩═╣|
|╠╗/╚╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╝\╔╣|
|╠╩╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╩╣|
|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|
|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|
|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|
|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|
|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|
|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═__________________________________________╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|
|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═| ▄                                    ▄ |╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|
|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═|   \-\----------------------------/-/   |╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|
|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═|   | \-\                      /-/   |   |╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|
|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═|   |  \-\                   /-/     |   |╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|
|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═|   |     \-\              /-/       |   |╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|
|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═|   |       \-\          /-/         |   |╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|
|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═|   |         \-\      /-/           |   |╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|
|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═|   |           \-\  /-/             |   |╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|
|╠\║╔╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═|   |            \/-/                |   |╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╗║/╣|
|╠═╩╝║╔╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═|   |            /-/\-\              |   |╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╗║╚╩═╣|
|╠═╦═╩╝║\╔═╩═╦═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═|   |         /-/      \-\           |   |╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╗/║╚╩═╦═╣|
|╠═╩═╦═╩═╣\╔═╩═╦═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═|   |       /-/          \-\         |   |╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╦═╩═╗/╠═╩═╦═╩═╣|
|╠═╦═╩═╦═╩═╣\╔═╩═╦═╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═|   |     /-/              \-\       |   |╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩═╦═╩═╗/╠═╩═╦═╩═╦═╣|
|╠\║╔╦═╩═╦═╩═╣\╔═╩═╦═╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═|   |   /-/                  \-\     |   |╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩═╦═╩═╗/╠═╩═╦═╩═╦╗║/╣|
|╠═╩╝║\╔═╩═╦═╩═╣\_╔╩═╦═╩═╦═╣|╠═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═|   | /-/                       \-\  |   |╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦╣|╠═╦═╩═╦═╩╗_/╠═╩═╦═╩═╗/║╚╩═╣|
|╠═╦═╩═╣\_╔╩═╦═╩═╦╝\╔╩═╦═╩═╣|╠═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═|   /-/                            \-\   |╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩═╦═╩╣|╠═╩═╦═╩╗/╚╦═╩═╦═╩╗_/╠═╩═╦═╣|
|╠╦╩═╦═╩═╦╝\╔╩═╦═╩═╦╝\╔╩═══╝|╚═╩═══╩═══╩═══╩═══╩═══╩═══╩═| ▀ |                                | ▀ |╩═══╩═══╩═══╩═══╩═══╩═══╩══╝|╚═══╩╗/╚╦═╩═╦═╩╗/╚╦═╩═╦═╩╦╣|
|╠╝\╔╩═╦═╩═╦╝\╔╩═══╩══╝__---¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯---__╚══╩═══╩╗/╚╦═╩═╦═╩╗/╚╣|
|╠═╦╝\╔╩═══╩══╝___--¯¯¯      ¯¯¯¯¯   ____            ¯¯¯¯¯¯          ________                   ¯¯¯¯¯¯¯         ____                 ¯¯¯--___╚══╩═══╩╗/╚╦═╣|
|╚═╩══╝___--¯¯¯           ___                       __                            ¯¯¯¯¯¯                _______              ¯¯¯¯     ___    ¯¯¯--___╚══╩═╝|
|__--¯¯                              ¯¯¯¯¯¯                                     ______                                     ____                      ¯¯--__|""",
"Target1": R"""šššš|šššš
šš┌-|-┐šš
----◉----
šš└-|-┘šš
šššš|šššš""",
"Target2": R"""┌-|-┐
--◉--
└-|-┘
""",
"Target3": R"""š|š
-◉-
š|š""",
"Target4": R"""◉""",
"CircleStay": R"""/¯¯¯¯¯\
|     |
|     |
\_____/""",
"AimMinigame": """>---------|---------<
>>--------|--------<<
>>>-------|-------<<<
>>>>------|------<<<<
>>>>>-----|-----<<<<<
>>>>>>----|----<<<<<<
>>>>>>>---|---<<<<<<<
>>>>>>>>--|--<<<<<<<<
>>>>>>>>>-|-<<<<<<<<<
>>>>>>>>>>|<<<<<<<<<<
>>>>>>>>>>◉<<<<<<<<<<""",
"Grid": """|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|--------------------|--------------------|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|____________________|____________________|""",
"GridTL": """|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|####################|šššššššššššššššššššš|
|####################|šššššššššššššššššššš|
|####################|šššššššššššššššššššš|
|####################|šššššššššššššššššššš|
|####################|šššššššššššššššššššš|
|####################|šššššššššššššššššššš|
|--------------------|--------------------|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|____________________|____________________|""",
"GridBL": """|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|--------------------|--------------------|
|********************|šššššššššššššššššššš|
|********************|šššššššššššššššššššš|
|********************|šššššššššššššššššššš|
|********************|šššššššššššššššššššš|
|********************|šššššššššššššššššššš|
|********************|šššššššššššššššššššš|
|____________________|____________________|""",
"GridTR": """|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|šššššššššššššššššššš|$$$$$$$$$$$$$$$$$$$$|
|šššššššššššššššššššš|$$$$$$$$$$$$$$$$$$$$|
|šššššššššššššššššššš|$$$$$$$$$$$$$$$$$$$$|
|šššššššššššššššššššš|$$$$$$$$$$$$$$$$$$$$|
|šššššššššššššššššššš|$$$$$$$$$$$$$$$$$$$$|
|šššššššššššššššššššš|$$$$$$$$$$$$$$$$$$$$|
|--------------------|--------------------|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|____________________|____________________|""",
"GridBR": """|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|šššššššššššššššššššš|šššššššššššššššššššš|
|--------------------|--------------------|
|šššššššššššššššššššš|≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡|
|šššššššššššššššššššš|≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡|
|šššššššššššššššššššš|≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡|
|šššššššššššššššššššš|≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡|
|šššššššššššššššššššš|≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡|
|šššššššššššššššššššš|≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡|
|____________________|____________________|""",
"BlackHole": """ššš__________ššš
š/šššššššššššš\š
|šššššššššššššš|
|šššššššššššššš|
|šššššššššššššš|
|šššššššššššššš|
š\šššššššššššš/š
ššš¯¯¯¯¯¯¯¯¯¯ššš""",
"ReactionFlash": """############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################
############################################################################################################################################################""",
"Shielded": """|¯¯¯¯¯¯¯¯¯|
|ššššššššš|
|ššššššššš|
|ššššššššš|
\ššššššššš/
š\ššššššš/š
šš\_____/šš""",
"KeyboardDefend": """š/¯\š
|ššš|
š\_/š""",
"GridMove": """┌--------------------------------------------------------------------------------┐
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
|šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš|
└--------------------------------------------------------------------------------┘""",
"Title1": R"""ššššššššššššššššššššššššššššššššššš/¯\ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš|š|ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš\_/ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš/¯\ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš|š|ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš\_/ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš/¯\ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš|š|ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš\_/ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš/¯\ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš|š|ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš\_/ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš/¯\ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš|š|ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš\_/ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš/¯\ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš|š|ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš\_/ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš/¯\ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš|š|ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš\_/ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš/¯\ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš|š|ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš\_/ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš/¯\ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš|š|ššššššššššššššššššššššššššššššššššš
ššššššššššššššššššššššššššššššššššš\_/ššššššššššššššššššššššššššššššššššš
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|      |¯¯¯\    ||       ¯¯||¯¯   |    |   |¯¯¯\    |¯¯¯¯¯   |¯¯¯\      |
|      |    |   ||         ||     |\   |   |    \   |        |    \     |
|      |---<    ||         ||     | \  |   |    |   |-----   |    |     |
|      |    |   \|         ||     |  \_|   |    /   |        |    /     |
|      |___/     \____   __||__   |    |   |___/    |_____   |___/      |
|_______________________________________________________________________|""",
"TitleOptions": R"""ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|                                           |
|                                           |
|                  Options.                 |
|                                           |
|                                           |
|___________________________________________|""",
"TitlePlay": R"""ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|                                           |
|                                           |
|                   Play!                   |
|                                           |
|                                           |
|___________________________________________|""",
"TitleOptionsHover": R"""ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|                                           |
|                                           |
|              >>> Options. <<<             |
|                                           |
|                                           |
|___________________________________________|""",
"TitlePlayHover": R"""ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|                                           |
|                                           |
|               >>> Play! <<<               |
|                                           |
|                                           |
|___________________________________________|""",
"EmptyBackground": R"""                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš                                                                                
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            
                                                                                                                                                                                                                                                                                                                            """,
"TitleSettings": R"""šššššššššššššššššššššššššš/¯\šššššššššššššššššššššššššš
šššššššššššššššššššššššššš|š|šššššššššššššššššššššššššš
šššššššššššššššššššššššššš\_/šššššššššššššššššššššššššš
šššššššššššššššššššššššššš/¯\šššššššššššššššššššššššššš
šššššššššššššššššššššššššš|š|šššššššššššššššššššššššššš
šššššššššššššššššššššššššš\_/šššššššššššššššššššššššššš
šššššššššššššššššššššššššš/¯\šššššššššššššššššššššššššš
šššššššššššššššššššššššššš|š|šššššššššššššššššššššššššš
šššššššššššššššššššššššššš\_/šššššššššššššššššššššššššš
šššššššššššššššššššššššššš/¯\šššššššššššššššššššššššššš
šššššššššššššššššššššššššš|š|šššššššššššššššššššššššššš
šššššššššššššššššššššššššš\_/šššššššššššššššššššššššššš
šššššššššššššššššššššššššš/¯\šššššššššššššššššššššššššš
šššššššššššššššššššššššššš|š|šššššššššššššššššššššššššš
šššššššššššššššššššššššššš\_/šššššššššššššššššššššššššš
šššššššššššššššššššššššššš/¯\šššššššššššššššššššššššššš
šššššššššššššššššššššššššš|š|šššššššššššššššššššššššššš
šššššššššššššššššššššššššš\_/šššššššššššššššššššššššššš
šššššššššššššššššššššššššš/¯\šššššššššššššššššššššššššš
šššššššššššššššššššššššššš|š|šššššššššššššššššššššššššš
šššššššššššššššššššššššššš\_/šššššššššššššššššššššššššš
šššššššššššššššššššššššššš/¯\šššššššššššššššššššššššššš
šššššššššššššššššššššššššš|š|šššššššššššššššššššššššššš
šššššššššššššššššššššššššš\_/šššššššššššššššššššššššššš
šššššššššššššššššššššššššš/¯\šššššššššššššššššššššššššš
šššššššššššššššššššššššššš|š|šššššššššššššššššššššššššš
šššššššššššššššššššššššššš\_/šššššššššššššššššššššššššš
šššššššššššššššššššššššššš/¯\šššššššššššššššššššššššššš
šššššššššššššššššššššššššš|š|šššššššššššššššššššššššššš
šššššššššššššššššššššššššš\_/šššššššššššššššššššššššššš
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                          .                          |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|                                                     |
|_____________________________________________________|""",
"TitleReturn": R"""šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|                                 |
|            <--- Back            |
|                                 |
|_________________________________|""",
"TitleReturnHover": R"""šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
šššššššššššššššš/¯\šššššššššššššššš
šššššššššššššššš|š|šššššššššššššššš
šššššššššššššššš\_/šššššššššššššššš
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|                                 |
|        >>> <--- Back <<<        |
|                                 |
|_________________________________|""",
"TitleHexagon": R"""ššššššššššš/¯\ššššššššššš
ššššššššššš|š|ššššššššššš
ššššššššššš\_/ššššššššššš
ššššššššššš/¯\ššššššššššš
ššššššššššš|š|ššššššššššš
ššššššššššš\_/ššššššššššš
ššššššššššš/¯\ššššššššššš
ššššššššššš|š|ššššššššššš
ššššššššššš\_/ššššššššššš
ššššššššššš/¯\ššššššššššš
ššššššššššš|š|ššššššššššš
ššššššššššš\_/ššššššššššš
ššššššššššš/¯\ššššššššššš
ššššššššššš|š|ššššššššššš
ššššššššššš\_/ššššššššššš
ššššššššššš/¯\ššššššššššš
ššššššššššš|š|ššššššššššš
ššššššššššš\_/ššššššššššš
ššššššššššš/¯\ššššššššššš
ššššššššššš|š|ššššššššššš
ššššššššššš\_/ššššššššššš
ššššššššššš/¯\ššššššššššš
ššššššššššš|š|ššššššššššš
ššššššššššš\_/ššššššššššš
ššššššššššš/¯\ššššššššššš
ššššššššššš|š|ššššššššššš
ššššššššššš\_/ššššššššššš
ššššššššššš/¯\ššššššššššš
ššššššššššš|š|ššššššššššš
ššššššššššš\_/ššššššššššš
ššššš/¯¯¯¯¯¯¯¯¯¯¯¯¯\ššššš
šššš/               \šššš
ššš/                 \ššš
šš/                   \šš
š/                     \š
/                       \
\                       /
š\                     /š
šš\                   /šš
ššš\                 /ššš
šššš\               /šššš
ššššš\_____________/ššššš""",
"Title7Sins": """ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
ššššššššššššššššššššš/¯\ššššššššššššššššššššš
ššššššššššššššššššššš|š|ššššššššššššššššššššš
ššššššššššššššššššššš\_/ššššššššššššššššššššš
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|
|                                           |
|                                           |
|            Choose Your Passive            |
|                                           |
|                                           |
|___________________________________________|""",
"FilledBlackHole": R"""ššš__________ššš
š/            \š
|              |
|              |
|              |
|              |
š\            /š
ššš¯¯¯¯¯¯¯¯¯¯ššš""",
"FilledBlackHoleClose": R"""ššš__________ššš
š//¯¯¯¯¯¯¯¯¯¯\\š
||            ||
||            ||
||            ||
||            ||
š\\__________//š
ššš¯¯¯¯¯¯¯¯¯¯ššš""",
"FilledBlackHoleFar": """ššš__________ššš
š/############\š
|##############|
|##############|
|##############|
|##############|
š\############/š
ššš¯¯¯¯¯¯¯¯¯¯ššš""",
"SettingsRoomsNormal": """┌------------┐
|   Normal   |
└------------┘""",
"SettingsRoomsNormalOn": """┌------------┐
|>  Normal  <|
└------------┘""",
"SettingsRoomsObfuscated": """┌------------┐
| Obfuscated |
└------------┘""",
"SettingsRoomsObfuscatedOn": """┌------------┐
|>Obfuscated<|
└------------┘""",
"SettingsRoomsAnimated": """┌------------┐
|  Animated  |
└------------┘""",
"SettingsRoomsAnimatedOn": """┌------------┐
|> Animated <|
└------------┘""",
"RoomSidebar": """ššš/¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯
šš/                     
š/                      
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯
|                       
|                       
|                       
|                       
|                       
|                       
|-----------------------
|                       
|       Play (E)        
|                       
|-----------------------
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|-----------------------
|                       
|       Exit (X)        
|                       
|_______________________
š\                      
šš\                     
ššš\____________________""",
"RoomSidebarExit": """ššš/¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯
šš/                     
š/                      
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯
|                       
|                       
|                       
|                       
|                       
|                       
|-----------------------
|                       
|       Play (E)        
|                       
|-----------------------
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|-----------------------
|                       
|   >>> Exit (X) <<<    
|                       
|_______________________
š\                      
šš\                     
ššš\____________________""",
"RoomSidebarPlay": """ššš/¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯
šš/                     
š/                      
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯
|                       
|                       
|                       
|                       
|                       
|                       
|-----------------------
|                       
|   >>> Play (E) <<<    
|                       
|-----------------------
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|-----------------------
|                       
|       Exit (X)        
|                       
|_______________________
š\                      
šš\                     
ššš\____________________""",
"RoomSidebarLocked": """ššš/¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯
šš/                     
š/                      
|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯
|                       
|                       
|                       
|                       
|                       
|                       
|-----------------------
|                       
|        Locked         
|                       
|-----------------------
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|                       
|-----------------------
|                       
|       Exit (X)        
|                       
|_______________________
š\                      
šš\                     
ššš\____________________""",
"RoomSelect": """š________________š
|šššššššššššššššš|
|šššššššššššššššš|
|šššššššššššššššš|
|šššššššššššššššš|
|šššššššššššššššš|
|šššššššššššššššš|
|šššššššššššššššš|
|šššššššššššššššš|
š¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯š""",
"UI": R"""šš/¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯\šš
š/                                                                 |                   |                  |         \š
/      Levels: |<--------------->              Light:    |         |     Inventory     |     Settings     |          \
\      Exp:    |<--------------->              Research: |         |                   |                  |          /
š\                                                                 |                   |                  |         /š
šš\________________________________________________________________|___________________|__________________|________/šš""",
"UIInventory": R"""šš/¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯\šš
š/                                                                 |                   |                  |         \š
/      Levels: |<--------------->              Light:    |         | >>> Inventory <<< |     Settings     |          \
\      Exp:    |<--------------->              Research: |         |                   |                  |          /
š\                                                                 |                   |                  |         /š
šš\________________________________________________________________|___________________|__________________|________/šš""",
"UISettings": R"""šš/¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯|¯¯¯¯¯¯¯¯\šš
š/                                                                 |                   |                  |         \š
/      Levels: |<--------------->              Light:    |         |     Inventory     | >>> Settings <<< |          \
\      Exp:    |<--------------->              Research: |         |                   |                  |          /
š\                                                                 |                   |                  |         /š
šš\________________________________________________________________|___________________|__________________|________/šš""",
}

#156 x 41



class Pyterminal:
    """
    Letter: a single "pixel" on the terminal screen.
    Item: a group of letters in a docstring.
    Whitespace: In an item it represents a whitespace.
    Empty-space: In an item it is designated as "š" and will leave the location empty.
    For example:
    HP: 75/100 | >===============-----<
    Mana: 50/100 | >==========----------<"""

    def __init__(self):
        """Defining varibles, such as screen size, fps, etc."""
        self.screenWidth = os.get_terminal_size().columns
        self.screenHeight = os.get_terminal_size().lines
        self.constantlyCheckScreenSize = True
        self.lettersToRender = {
            (10, 12): "O",
            (9, 12): "\\",
            (11, 12): "/",
        }
        self.screenRender = []
        self.fps = 60
        self.debugMessages = []
        self.keyBindsStatus = {
            "up": {"state": False, "keybind": "w"},
            "left": {"state": False, "keybind": "a"},
            "down": {"state": False, "keybind": "s"},
            "right": {"state": False, "keybind": "d"},
        }
        self.mouseStatus = {""}
        self.lock = threading.Lock()

    # Controls the printing of errors to prevent breaking of UI
    # Arg message: the message which will be printed
    def addDebugMessage(self, message):
        self.debugMessages.append(
            "".join(["> ", time.strftime("%H:%M:%S", time.localtime()), " | ", message])
        )

    def clearDebugMessages(self):
        self.debugMessages = []

    def removeDebugMessage(self, position, firstAdded=True):
        if firstAdded == True:
            self.debugMessages[position].pop()
        else:
            self.debugMessages[len(self.debugMessages) - position].pop()

    def renderDebugMessages(self, messageLimit=5):
        for row in range(min(messageLimit, len(self.debugMessages))):
            self.addItem(
                self.debugMessages[len(self.debugMessages) - 1 - row],
                yBias=-1 * row,
                itemAnchor="bottom right",
                screenAnchor="bottom right",
            )
        if len(self.debugMessages) - messageLimit == 1:
            self.addItem(
                "".join(
                    [
                        "> There is 1 more debug message",
                    ],
                ),
                yBias=-1 * messageLimit,
                itemAnchor="bottom right",
                screenAnchor="bottom right",
            )
        elif len(self.debugMessages) > messageLimit:
            self.addItem(
                "".join(
                    [
                        "> There are ",
                        str(len(self.debugMessages) - messageLimit),
                        " more debug messages",
                    ],
                ),
                yBias=-1 * messageLimit,
                itemAnchor="bottom right",
                screenAnchor="bottom right",
            )

    # Adds a single letter into the dictionary of letters to be rendered
    # Not the recommended way to remove letters use removeLetter() instead
    # Arg coords: the key which the letter will be asigned to
    # Arg letter: the letter which will be assigned to the coords
    # Arg overwrite: allows the user to choose if they wish to allow overwrites
    def addLetter(self, coords: tuple, letter: str, overwrite=True):
        if overwrite == False:
            if coords in self.lettersToRender:
                self.addDebugMessage("You are trying to overwrite something")
        self.lettersToRender[coords] = letter

    # Removes all letters from dictionary of letters to be rendered
    def clearLetters(self):
        self.lettersToRender = {}

    # Removes both the key and value of a given position from the dictionary of letters to be rendered
    # Using this will prevent clashing with addLetter()'s overwrite protection function and prevents the breaking of UI
    # Arg coords: the key which along with its value will be removed
    def removeLetter(self, coords: tuple):
        del self.lettersToRender[coords]

    # Returns the value of a given key in the dictionary of letters to be rendered
    # Arg coords: the key which the value will be returned
    def getLetter(self, coords: tuple):
        return self.lettersToRender[coords]

    # Adds a border aroun
    def addBorder(
        self,
        text,
        top=True,
        bottom=True,
        left=True,
        right=True,
        borderCharacter="-",
        cornerCharacter="+",
    ):
        lines = text.splitlines()
        maxLen = max(len(line) for line in lines)
        borderedLines = []
        if top:
            borderedLines.append(
                (cornerCharacter if left else "")
                + (
                    borderCharacter
                    * (maxLen + (1 if right else 0) + (1 if left else 0))
                )
                + (cornerCharacter if right else "")
            )
        for line in lines:
            padded = line.ljust(maxLen)
            borderedLine = ""
            if left:
                borderedLine += "| "
            borderedLine += padded
            if right:
                borderedLine += " |"
            borderedLines.append(borderedLine)
        if bottom:
            borderedLines.append(
                (cornerCharacter if left else "")
                + (
                    borderCharacter
                    * (maxLen + (1 if right else 0) + (1 if left else 0))
                )
                + (cornerCharacter if right else "")
            )
        return "\n".join(borderedLines)

    def addItem(
        self,
        item: str,
        xBias=0,
        yBias=0,
        screenAnchor="top left",
        itemAnchor="top left",
        emptySpaceLetter="š",
    ):

        splitItem = item.splitlines()
        longestRowLen = 0
        for rowNum in range(len(splitItem)):
            if len(splitItem[rowNum]) > longestRowLen:
                longestRowLen = len(splitItem[rowNum])
            splitItem[rowNum] = list(splitItem[rowNum])
        if screenAnchor == "top left":
            xAnchor, yAnchor = 0, 0
        elif screenAnchor == "top right":
            xAnchor, yAnchor = self.screenWidth, 0
        elif screenAnchor == "bottom left":
            xAnchor, yAnchor = 0, self.screenHeight
        elif screenAnchor == "bottom right":
            xAnchor, yAnchor = self.screenWidth, self.screenHeight
        elif screenAnchor == "center" or screenAnchor == "centre":
            xAnchor, yAnchor = math.ceil(self.screenWidth / 2), math.ceil(
                self.screenHeight / 2
            )
        else:
            self.addDebugMessage(
                "".join(["Invalid input for screenAnchor in addItem():", screenAnchor])
            )
        if itemAnchor == "top left":
            yAnchor -= 0
            xAnchor -= 0
        elif itemAnchor == "top right":
            xAnchor -= longestRowLen
            yAnchor -= 0
        elif itemAnchor == "bottom left":
            xAnchor -= 0
            yAnchor -= len(splitItem)
        elif itemAnchor == "bottom right":
            xAnchor -= longestRowLen
            yAnchor -= len(splitItem)
        elif screenAnchor == "center" or screenAnchor == "centre":
            xAnchor -= math.ceil(longestRowLen / 2)
            yAnchor -= math.ceil(len(splitItem) / 2)
        else:
            self.addDebugMessage(
                "".join(["Invalid input for itemAnchor in addItem():", itemAnchor])
            )
        xAnchor += xBias
        yAnchor += yBias
        for rowNum in range(len(splitItem)):
            for columnNum in range(len(splitItem[rowNum])):
                if splitItem[rowNum][columnNum] != emptySpaceLetter:
                    self.addLetter(
                        (columnNum + xAnchor, rowNum + yAnchor),
                        splitItem[rowNum][columnNum],
                    )
        return (xAnchor + math.floor(longestRowLen / 2), yAnchor + math.floor(len(splitItem) / 2))

    def checkScreenSize(self, override=False):
        if self.constantlyCheckScreenSize == True or override == True:
            self.screenWidth = os.get_terminal_size().columns
            self.screenHeight = os.get_terminal_size().lines

    def renderScreen(self):
        if self.constantlyCheckScreenSize == True:
            self.checkScreenSize()
        self.screenRender = [
            [" " for _ in range(self.screenWidth)] for _ in range(self.screenHeight)
        ]
        for row in range(self.screenHeight):
            for coords in self.lettersToRender:
                if coords[1] == row:
                    if 0 <= coords[0] < len(self.screenRender[row]):
                        self.screenRender[row][coords[0]] = self.lettersToRender[coords]
        for row in range(len(self.screenRender)):
            self.screenRender[row] = "".join(self.screenRender[row])

    def displayScreen(self, advanceMode=True, clearScreen=False):
        if clearScreen:
            os.system("cls")

        if advanceMode == True:
            sys.stdout.write("\033[H")
            for rowNum in range(len(self.screenRender)):
                sys.stdout.write(
                    f"\033[{rowNum+1};1f{''.join(self.screenRender[rowNum])}"
                )
                sys.stdout.write(f"\033[{self.screenHeight};{self.screenWidth}H")
                sys.stdout.flush()

        else:
            print(self.screenRender, end="")

    def updateKeys(self, keysBinds=["all"]):
        if keysBinds == ["all"]:
            for key in self.keyBindsStatus:
                self.keyBindsStatus[key]["state"] = keyboard.is_pressed(
                    self.keyBindsStatus[key]["keybind"]
                )
        elif keysBinds != [] and type(keysBinds) is list:
            for key in keysBinds:
                self.keyBindsStatus[key]["state"] = keyboard.is_pressed(
                    self.keyBindsStatus[key]["keybind"]
                )

    def getKeyBinds(self, keyBind: str, update=False) -> bool:
        if update == True:
            self.keyBindsStatus[keyBind]["state"] = keyboard.is_pressed(
                self.keyBindsStatus[keyBind]["keybind"]
            )
        return self.keyBindsStatus[keyBind]["state"]

    def onMove(self):
        with self.lock:
            self.mouseStatus
    def onClick(self):
        with self.lock:
            pass

    def onScroll(self):
        with self.lock:
            pass


pyterm = Pyterminal()