itemObjects = {
    "example target": {
        "animation frames": [
            R"""
šššš│šššš
šššš│šššš
----+----
šššš│šššš
šššš│šššš
""",
            R"""
šš│šš
--+--
šš│šš
""",
            R"""
+
""",
        ],
        "x": 0,
        "y": 0,
        "x bias": 0,
        "y bias": 0,
        "width": 1,
        "height": 1,
        "current frame": 0,
        "parent object": "screen",
        "parent anchor": "top left",
        "child anchor": "center",
        "is empty character part of hitbox": False,
    },
}
keyBindsStatus = {
    "up": {"state": False, "keybind": "w"},
    "left": {"state": False, "keybind": "a"},
    "down": {"state": False, "keybind": "s"},
    "right": {"state": False, "keybind": "d"},
}
mouseStatus = {
    "absolute position": (0, 0),
    "left button": False,
    "right button": False,
    "middle button": False,
    "left button release": False,
    "right button release": False,
    "middle button release": False,
    "scroll x": 0,
    "scroll y": 0,
}
endEscapeCode = "\033[0m"
styleCodes = {
    "reset": 0,
    "normal": 0,
    "bold": 1,
    "dim": 2,
    "italic": 3,
    "underline": 4,
    "blink": 5,
    "inverse": 7,
    "reverse": 7,
    "invisible": 8,
    "hidden": 8,
    "strikethrough": 9,
}
colorCodes = {
    "Black": 30,
    "Red": 31,
    "Green": 32,
    "Yellow": 33,
    "Blue": 34,
    "Magenta": 35,
    "Cyan": 36,
    "White": 37,
}
ASSETS = {
    #
    # ┌──────────────────────────────┬──────────────────────────────┬──────────────────────────────┬──────────────────────────────┐
    # │                              │                              │                              │                              │
    # │            FIGHT             │            ITEMS             │         INFORMATION          │             RUN              │
    # │                              │                              │                              │                              │
    # ┌──────────────────────────────┬──────────────────────────────┬──────────────────────────────┬──────────────────────────────┐
    # │ ╔            ╦             ╗ │                              │                              │                              │
    # │ ║      >>> FIGHT <<<       ║ │            ITEMS             │         INFORMATION          │             RUN              │
    # │ ╚            ╩             ╝ │                              │                              │                              │
    "center barrier": [
        R"""┬
│
│
│""",
        R"""┼
│
│
│""",
    ],
    "left barrier": [
        R"""┌
│
│
│""",
        R"""├
│
│
│""",
    ],
    "right barrier": [
        R"""┐
│
│
│""",
        R"""┤
│
│
│""",
    ],
    "fight button": [
        R"""──────────────────────────────
                              
            FIGHT             
                              """,
        R"""──────────────────────────────
                              
        >>> FIGHT <<<         
                              """,
        R"""──────────────────────────────
 ╔            ╦             ╗ 
 ║          FIGHT           ║ 
 ╚            ╩             ╝ """,
        R"""──────────────────────────────
 ╔            ╦             ╗ 
 ║      >>> FIGHT <<<       ║ 
 ╚            ╩             ╝ """,
    ],
    "items button": [
        R"""──────────────────────────────
                              
            ITEMS             
                              """,
        R"""──────────────────────────────
                              
        >>> ITEMS <<<         
                              """,
        R"""──────────────────────────────
 ╔            ╦             ╗ 
 ║          ITEMS           ║ 
 ╚            ╩             ╝ """,
        R"""──────────────────────────────
 ╔            ╦             ╗ 
 ║      >>> ITEMS <<<       ║ 
 ╚            ╩             ╝ """,
    ],
    "information button": [
        R"""──────────────────────────────
                              
            GUARD             
                              """,
        R"""──────────────────────────────
                              
     >>>    GUARD    <<<      
                              """,
        R"""──────────────────────────────
 ╔            ╦             ╗ 
 ║          GUARD           ║ 
 ╚            ╩             ╝ """,
        R"""──────────────────────────────
 ╔            ╦             ╗ 
 ║   >>>    GUARD    <<<    ║ 
 ╚            ╩             ╝ """,
    ],
    "run button": [
        R"""──────────────────────────────
                              
             RUN              
                              """,
        R"""──────────────────────────────
                              
         >>> RUN <<<          
                              """,
        R"""──────────────────────────────
 ╔            ╦             ╗ 
 ║           RUN            ║ 
 ╚            ╩             ╝ """,
        R"""──────────────────────────────
 ╔            ╦             ╗ 
 ║       >>> RUN <<<        ║ 
 ╚            ╩             ╝ """,
    ],
    # ┌──────────────────────────────┬──────────────────────────────┬──────────────────────────────┬──────────────────────────────┐
    # │>        PLACEHOLDER1        <│>        PLACEHOLDER2        <│>        PLACEHOLDER3        <│>        PLACEHOLDER4        <│
    # ├──────────────────────────────┼──────────────────────────────┼──────────────────────────────┼──────────────────────────────┤
    # │>        PLACEHOLDER5        <│>        PLACEHOLDER6        <│>        PLACEHOLDER7        <│>        PLACEHOLDER8        <│
    "fight box": [
        R"""┌──────────────────────────────┬──────────────────────────────┬──────────────────────────────┬──────────────────────────────┐
│>        PLACEHOLDER1        <│>        PLACEHOLDER2        <│>        PLACEHOLDER3        <│>        PLACEHOLDER4        <│
├──────────────────────────────┼──────────────────────────────┼──────────────────────────────┼──────────────────────────────┤
│>        PLACEHOLDER5        <│>        PLACEHOLDER6        <│>        PLACEHOLDER7        <│>        PLACEHOLDER8        <│""",
        R"""┌──────────────────────────────┼─┴────────────────────────────┬────────────────────────────┴─┼──────────────────────────────┐
│>        PLACEHOLDER1        <│>        PLACEHOLDER2        <│>        PLACEHOLDER3        <│>        PLACEHOLDER4        <│
├──────────────────────────────┼──────────────────────────────┼──────────────────────────────┼──────────────────────────────┤
│>        PLACEHOLDER5        <│>        PLACEHOLDER6        <│>        PLACEHOLDER7        <│>        PLACEHOLDER8        <│""",
    ],
    "items box": [
        R"""┌──────────────────────────────┬──────────────────────────────┬──────────────────────────────┬──────────────────────────────┐
│>        PLACEHOLDER1        <│>        PLACEHOLDER2        <│>        PLACEHOLDER3        <│>        PLACEHOLDER4        <│
├──────────────────────────────┼──────────────────────────────┼──────────────────────────────┼──────────────────────────────┤
│>        PLACEHOLDER5        <│>        PLACEHOLDER6        <│>        PLACEHOLDER7        <│>        PLACEHOLDER8        <│"""
    ],
    "information box": [
        R"""┌──────────────────────────────┬──────────────────────────────┬──────────────────────────────┬──────────────────────────────┐
│>        PLACEHOLDER1        <│>        PLACEHOLDER2        <│>        PLACEHOLDER3        <│>        PLACEHOLDER4        <│
├──────────────────────────────┼──────────────────────────────┼──────────────────────────────┼──────────────────────────────┤
│>        PLACEHOLDER5        <│>        PLACEHOLDER6        <│>        PLACEHOLDER7        <│>        PLACEHOLDER8        <│"""
    ],
    "run box": [
        R"""┌──────────────────────────────┬──────────────────────────────┬──────────────────────────────┬──────────────────────────────┐
│>        PLACEHOLDER1        <│>        PLACEHOLDER2        <│>        PLACEHOLDER3        <│>        PLACEHOLDER4        <│
├──────────────────────────────┼──────────────────────────────┼──────────────────────────────┼──────────────────────────────┤
│>        PLACEHOLDER5        <│>        PLACEHOLDER6        <│>        PLACEHOLDER7        <│>        PLACEHOLDER8        <│"""
    ],
    "enemy selection box": [
        #        R"""──────────────────────────────┐
        #                               │
        # >        PLACEHOLDER1        <│
        #                               │
        # ──────────────────────────────┤
        #                               │
        # >        PLACEHOLDER2        <│
        #                               │╲
        # ──────────────────────────────┼─╲
        #                               │ E╲
        # >        PLACEHOLDER3        <│ N │
        #                               │ E │
        # ──────────────────────────────┤ M │
        #                               │ Y │
        # >        PLACEHOLDER4        <│   │
        #                               │ S │
        # ──────────────────────────────┤ E │
        #                               │ L │
        # >        PLACEHOLDER5        <│ E │
        #                               │ C │
        # ──────────────────────────────┤ T │
        #                               │ I │
        # >        PLACEHOLDER6        <│ O │
        #                               │ N╱
        # ──────────────────────────────┼─╱
        #                               │╱
        # >        PLACEHOLDER7        <│
        #                               │
        # ──────────────────────────────┤
        #                               │
        # >        PLACEHOLDER8        <│
        #                               │
        # ──────────────────────────────┘"""
        R"""──────────────────────────────┐
                              │
>        PLACEHOLDER1        <│
                              │
──────────────────────────────┤
                              │╲
>        PLACEHOLDER2        <│─╲
                              │ E╲
──────────────────────────────┤ N │
                              │ E │
>        PLACEHOLDER3        <│ M │
                              │ Y │
──────────────────────────────┤   │
                              │ S │
>        PLACEHOLDER4        <│ E │
                              │ L │
──────────────────────────────┤ E │
                              │ C │
>        PLACEHOLDER5        <│ T │
                              │ I │
──────────────────────────────┤ O │
                              │ N╱
>        PLACEHOLDER6        <│─╱
                              │╱
──────────────────────────────┤
                              │
>        PLACEHOLDER7        <│
                              │
──────────────────────────────┘"""
    ],
    "enemy selection option": [
        R""" ╔                          ╗ 
 ║>                        <║ 
 ╚                          ╝ """,
    ],
    "enemy information box": [
        R"""┌──────────────────────────────
│             ...
├──────────────────────────────
│ Select an enemy on the left
│ to attack and view
│ information...
│
│
│
│
│
│
│
│
│
│
│
│
│
│
│
│
└──────────────────────────────""",
        R"""┌──────────────────────────────
│>      PLACEHOLDERNAME       <
├──────────────────────────────
│ Health: [hp]/[max hp]
│
│ Health Regen: [hp regen]
│
│ Defence: [def]
│
│ Magic Defence: [magic def]
│
│ Strength: [strength]
│
│ Magic Power: [magic power]
│
│ Critical Chance: [crit chance]
│
│ Critical Power: [crit power]
│
│ True Attack: [true attack]
│
│ True Defence: [true def]
└──────────────────────────────""",
        R"""┌──────────────────────────────
│>      PLACEHOLDERNAME       <
├──────────────────────────────
│ Health: [hp]/[max hp]
│
│ Health Regen: [hp regen]
│
│ Defence: [def]
│
│ Magic Defence: [magic def]
│
│ Strength: [strength]
│
│ Magic Power: [magic power]
│
│ Critical Chance: [crit chance]
│
│ Critical Power: [crit power]
│
│ True Attack: [true attack]
│
│ True Defence: [true def]
└──────────────────────────────""",
    ],
    "run bar": [
        R"""     ┌──────│
     │  ┌───│
   ╱┬┴──┴┬  │
  ╱ │    │  │
 ╱  │    │  │
╱   │    │  │
│ M │    │  │
│ E │    │  │
│ R │    │  │
│ C │░░░░│  │
│ Y │▓▓▓▓│  │
╲   │████│  │
 ╲  │████│  │
  ╲ │████│  │
   ╲┴┬──┬┴  │
     │  └───│
     └──────│"""
    ],
    "ultimate bar": [
        R"""šššššššš╱─────────────────────────────────────────────╲šššššššš
ššššššš╱            Whispers Of The Ultimate           ╲ššššššš
ššššš├╱─────────────────────────────────────────────────╲┤ššššš
┌────┤                                                   ├────┐
│ ┌──┤                                                   ├──┐ │
│ │šš├───────────────────────────────────────────────────┤šš│ │""",
    ],
    "ultimate button": [
        # ┌──────────────────────────────┬──────────────────────────────┬──────────────────────────────┬──────────────────────────────┐
        # │>        PLACEHOLDER1        <│>        PLACEHOLDER2        <│>        PLACEHOLDER3        <│>        PLACEHOLDER4        <│
        # ├──────────────────────────────┼──────────────────────────────┼──────────────────────────────┼──────────────────────────────┤
        # │>        PLACEHOLDER5        <│>        PLACEHOLDER6        <│>        PLACEHOLDER7        <│>        PLACEHOLDER8        <│
        #         R"""ššššššššššššššššššššššššššššššš┴šššššššššš∆šššššššššššššššššš─šššššššššššššššššššššššššššššš┴šššššššššššššššššššššššššššššš
        # š                                         )|(______________________________________________                                š
        # │                               (O)XXXXXX[<O>]▻✧                                          ✧⧹                                │
        # š                                         )|(‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾                               š
        # ššššššššššššššššššššššššššššššš┬ššššššššššš∇šššššššššššššššššš┬šššššššššššššššššššššššššššššš┬ššššššššššššššššššššššššššššššš"""
        R"""┌──────────────────────────────┴─┴─────────∆───────────────────────────────────────────────┴─┴──────────────────────────────┐
│ ╔                                       )|(______________________________________________                               ╗ │
│ ║                             (○)XXXXXX[<○>]▻✧                                          ✧⧹                              ║ │
│ ╚                                       )|(‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾                              ╝ │
├──────────────────────────────┬───────────∇──────────────────┬──────────────────────────────┬──────────────────────────────┤"""
    ],
    "info bar": [
        R"""╲[bar]┤[[hp] / [maxhp]]├[bar2]╱
š╲────────────────────────────────────────────────────────────────────────┼────────────────────────────────────────────────────────────────────────╱
šš╲[bar3]}[[energy] / [maxenergy]] Energy │ Mana   [[mana] / [maxmana]]{[bar4]╱
ššš╲──────────────────────────────────────────────────────────────────╲   │   ╱──────────────────────────────────────────────────────────────────╱
šššš╲──────────────────────────────────────────────────────────────────╲──┴──╱──────────────────────────────────────────────────────────────────╱
šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš╲ ↻ ╱
ššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš‾‾‾""",
        R"""╲                                                                         1                                                                         ╱
š╲                                                                        2                                                                        ╱
šš╲                                                                       3                                                                       ╱
ššš╲                                                                      4                                                                      ╱
šššš╲──────────────────────────────────────────────────────────────────╲─────╱──────────────────────────────────────────────────────────────────╱
šššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš╲ ↻ ╱
ššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššššš‾‾‾""",
    ],
    "Slime": [
        R"""
ššš__________ššš

šš/          \šš
š/     (O)    \š
/______________\\"""
    ],
}
[
    "┐",
    "└",
    "┴",
    "┬",
    "├",
    "─",
    "┼",
    "┘",
    "┌",
    "│",
    "┤",
    "╱",
    "╲",
    "╳",
    "╣",
    "║",
    "╗",
    "╝",
    "╚",
    "╔",
    "╩",
    "╦",
    "╠",
    "═",
    "╬",
    "░",
    "▒",
    "▓",
    "█",
    "▄",
    "▀",
    "■",
]
#     |^^^|
#      }_{
#      }_{
#  /|_/---\_|\
# <I _|\_/|_ I>
#  \| |   | |/
#     |   |
#     |   |
#     |   |
#     |   |
#     |   |
#     |   |
#     |   |
#     \   /
#      \ /
#       ∇
#

#            ∆
#           )|(______________________________________________
# (O)✕✕✕✕[<O>]▻✧                                         ✦⧹
#           )|(‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
#            ∇
